In [1]:
import pandas as pd

In [2]:
url = "https://tinyurl.com/titanic-csv"
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [3]:
dataframe = pd.DataFrame()  # initialization of the new dataframe
dataframe["Name"] = ["Jackie Jackson", "Stieven Stievenson"]
dataframe["Age"] = [38, 25]
dataframe["Driver"] = [True, False]
dataframe

                 Name  Age  Driver
0      Jackie Jackson   38    True
1  Stieven Stievenson   25   False

In [4]:
new_person = pd.Series(["Molly Munie", 40, True], index=["Name", "Age", "Driver"])
dataframe.append(new_person, ignore_index=True)  # append values to the dataframe

                 Name  Age  Driver
0      Jackie Jackson   38    True
1  Stieven Stievenson   25   False
2         Molly Munie   40    True

In [5]:
dataframe = pd.read_csv(url)
dataframe.shape  # quantity of rows and columns

(1313, 6)

In [6]:
dataframe.describe()  # descriptive statistics of the dataframe

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [7]:
dataframe.iloc[0]  # get row from  the dataframe by index

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [8]:
dataframe.iloc[1:4]  # get slice from the dataframe

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [9]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [10]:
dataframe = dataframe.set_index(dataframe["Name"])  # set key column at the dataframe
dataframe.loc["Allen, Miss Elisabeth Walton"]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [11]:
dataframe[dataframe["Sex"] == "female"].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [12]:
dataframe[(dataframe["Sex"] == "female") & (dataframe["Age"] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [13]:
dataframe["Sex"].replace("female", "Woman").head(2)

Name
Allen, Miss Elisabeth Walton    Woman
Allison, Miss Helen Loraine     Woman
Name: Sex, dtype: object

In [14]:
dataframe.replace(1, "One").head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29,female,One,One
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2,female,0,One

In [15]:
dataframe.replace(r"1st", "First", regex=True).head(2)  # replace with regex

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.0,female,0,1

In [16]:
dataframe.rename(columns={"PClass": "Passenger Class", "Sex": "Gender"}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [17]:
print("Max:", dataframe['Age'].max())
print("Min:", dataframe['Age'].min())
print(f"Avg: {dataframe['Age'].mean():.2f}")
print("Sum:", dataframe['Age'].sum())
print("Count:", dataframe['Age'].count())

Max: 71.0
Min: 0.17
Avg: 30.40
Sum: 22980.88
Count: 756

In [18]:
dataframe["Sex"].unique()

array(['female', 'male'], dtype=object)

In [19]:
dataframe["Sex"].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [20]:
dataframe["PClass"].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [21]:
dataframe["PClass"].nunique() == 4

True

In [22]:
dataframe[dataframe["Age"].isnull()].head(2)  # rows with null-value at Age column

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,male,1,0

In [23]:
dataframe.drop("Age", axis=1).head(2)  # delete the column by name

,Name,PClass,Sex,Survived,SexCode
Name,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,female,0,1

In [24]:
dataframe.drop(["Age", "Sex"], axis=1).head(2)  # delete the columns by names

,Name,PClass,Survived,SexCode
Name,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,0,1

In [25]:
dataframe.drop(dataframe.columns[1], axis=1).head(2)  # delete the column by index

,Name,Age,Sex,Survived,SexCode
Name,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",2.0,female,0,1

In [26]:
dataframe[dataframe["Name"] != "Allison, Miss Helen Loraine"].head(2)  # hide the row

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0

In [27]:
dataframe.drop_duplicates(subset=["Sex"], keep="last")  # delete the dupicates from dataframe

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Zabour, Miss Tamini","Zabour, Miss Tamini",3rd,NaN,female,0,1
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.0,male,0,0

In [28]:
dataframe.groupby("Sex").mean()  # avg age and survival by gender

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [29]:
dataframe.groupby("Survived")["Name"].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [30]:
dataframe.groupby(["Sex", "Survived"])["Age"].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64